
import 'package:najme/data.dart';

String initialMessage = "أهلاً أستاذ ${profile.name.split(" ")[1]}\nكيف أساعدك اليوم؟";

const Map<String, String> advices = {
  "نصائح عامة": 
"""
- اجعل طفلك يتدرب على حل مسائل أكثر.
- اجعل طفلك يستمع إلى أغاني باللغة الإنجليزية لتقوية استماعه.
- اجعله يحسب النقود في المشتريات الخفيفة.""",

  "نصائح في كل مادة": 
"""
لغة عربية:
 - تحدث معه باللغة العربية الفصحى.
حساب:
 - اشترِ له كتاب مسائل واجعله يحل صفحة يومياً.
English:
 - اجعله يحفظ كلمة واحدة كل يوم.""",

  "ترتيب المواد بالأفضلية": 
"""
- أكثر مادة يحبها هي الإنجليزية.
- أقل مادة يحبها هي الحساب.""",

  "الحالة العامة لمستوى الطالب": "جيد جداً (85%)",

  "المستوى العام قي كل مادة": 
"""
لغة عربية:
 - جيد جداً 87%
حساب:
 - جيد 68%
English:
 - ممتاز 94%""",
};
